# символ присутствует в строке
# 'O' in i
# i.count('O') >= 1

# символ встречается в строке определенное кол-во раз
# i.count('K') == 2

# символ не встречается в строке
# 'IG' not in i
# i.count('IG') == 0

# Проверка, что каждый символ использовался ровно один раз
# Проверка, что все символы уникальны
if len(i) == len(set(i)):

# Проверка, что трока не начинается на какой то символ
if i[0] != 'K'


# В любой задаче с числами не обходимо проверять,
# что число не начинается на ноль
if i[0] != '0':

    # В лоб перебираем все подходящие комбинации
    if 'АИ' in i or 'ИА' in i or 'АА' in i or 'ИИ' in i:

    # Заменяем все буквы на какой-то один символ для сужения вариантов
    i = i.replace('A', '*')
    i = i.replace('И', '*')
    if '**' in i:

    # Компактно заменяем все буквы на какой-то один символ
    for j in 'АИ':
        i = i.replace(j, '*')
    if '**' in i:


9777
1. Е К М О П Р Т Ь
2. 0 1 2 3 4 5 6 7 8
3. sys = 9
4. ЮЮЮКК
5. 58979

TASK-8-17549

1. К О С У Ф
2. 0 1 2 3 4
3. sys = 5
4. УУССС = 33222
5. 2313

